Revit 2027 API
FamilySizeTableManager.GetAllSizeTableNames Method
 Get the FamilySizeTable names in a family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetAllSizeTableNames()
Public Function GetAllSizeTableNames As IList(Of String)
public:
IList<String^>^ GetAllSizeTableNames()
member GetAllSizeTableNames : unit -> IList<string>
Return Value
IList<String>
 Array of size table names.
See Also
Reference
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace